In [4]:
import numpy as np
import pandas as pd

df = pd.DataFrame(
    {
        "B2": pd.date_range("20130101", periods=6),
        "C": pd.Series([1, 3, 5, np.nan, 6, 8], dtype="float32"),
        "D": np.arange(1, 7),
        "E": pd.Categorical(["test", "train", "test", "train", "one", "train"]),
    }
)

## To NumPy

In [5]:
df.to_numpy()

array([[Timestamp('2013-01-01 00:00:00'), 1.0, 1, 'test'],
       [Timestamp('2013-01-02 00:00:00'), 3.0, 2, 'train'],
       [Timestamp('2013-01-03 00:00:00'), 5.0, 3, 'test'],
       [Timestamp('2013-01-04 00:00:00'), nan, 4, 'train'],
       [Timestamp('2013-01-05 00:00:00'), 6.0, 5, 'one'],
       [Timestamp('2013-01-06 00:00:00'), 8.0, 6, 'train']], dtype=object)

## Drop

In [7]:
df.drop("B2", axis=1)

     C  D      E
0  1.0  1   test
1  3.0  2  train
2  5.0  3   test
3  NaN  4  train
4  6.0  5    one
5  8.0  6  train

In [8]:
df

          B2    C  D      E
0 2013-01-01  1.0  1   test
1 2013-01-02  3.0  2  train
2 2013-01-03  5.0  3   test
3 2013-01-04  NaN  4  train
4 2013-01-05  6.0  5    one
5 2013-01-06  8.0  6  train

## Transformation

In [6]:
df.T

,0,1,2,3,4,5
B2,2013-01-01 00:00:00,2013-01-02 00:00:00,2013-01-03 00:00:00,2013-01-04 00:00:00,2013-01-05 00:00:00,2013-01-06 00:00:00
C,1.0,3.0,5.0,NaN,6.0,8.0
D,1,2,3,4,5,6
E,test,train,test,train,one,train